app/views/games/index.html.erb

SELECT "games".* FROM "games"
SELECT COUNT(*) FROM "games"
---
<h1><%= pluralize(@games.size, 'Game') %></h1>