app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @game = Game.find(params[:id])

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "games" SET "title" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["title", "Updated Game Title"], ["updated_at", 2016-07-25 11:28:10 UTC], ["id", 1]]
---
  def update
    @game = Game.find(params[:id])
    @game.update(game_params)

INSERT INTO "games" ("title", "maxplayercount", "gametype", "description", "released_in", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(game_params)
    @game.save